modm-ext/data.modm.io/docs/svd/header_stm32u5g7xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PWR</name>
      <description>Power Control</description>
      <groupName>PWR</groupName>
      <baseAddress>0x46020800</baseAddress>
      <interrupt>
        <name>PWR_S3WU</name>
        <description>PWR wake up from Stop3 interrupt</description>
        <value>77</value>
      </interrupt>
      <registers>
        <register>
          <name>CR1</name>
          <description>Power control register 1</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LPMS</name>
              <description>LPMS[2:0] Low-power mode selection field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOP0_MODE</name>
                  <description>Stop 0 mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP1_MODE</name>
                  <description>Stop 1 mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP2_MODE</name>
                  <description>Stop 2 mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP3_MODE</name>
                  <description>Stop 3 mode</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STANDBY_MODE</name>
                  <description>Standby mode</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHUTDOWN_MODE</name>
                  <description>Shutdown mode</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RRSB1</name>
              <description>SRAM2 page 2 Retention in Standby</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RRSB2</name>
              <description>SRAM2 page 1 Retention in Standby</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ULPMEN</name>
              <description>BOR ultra-low power mode in Standby/Shutdown</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM1PD</name>
              <description>SRAM1 power-down in Run mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM2PD</name>
              <description>SRAM2 power-down in Run mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM3PD</name>
              <description>SRAM3 power-down in Run mode</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM4PD</name>
              <description>SRAM4 power-down in Run mode</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM5PD</name>
              <description>SRAM5 power down</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM6PD</name>
              <description>SRAM6 power down</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FORCE_USBPWR</name>
              <description>Force USB PWR</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <description>Power control register 2</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SRAM1PDS1</name>
              <description>SRAM1 page 1 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM1PDS2</name>
              <description>SRAM1 page 2 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM1PDS3</name>
              <description>SRAM1 page 3 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM2PDS1</name>
              <description>SRAM2 page 1 (8 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM2PDS2</name>
              <description>SRAM2 page 2 (56 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM4PDS</name>
              <description>SRAM4 power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DC2RAMPDS</name>
              <description>DCACHE2 SRAM power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ICRAMPDS</name>
              <description>ICACHE SRAM power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DC1RAMPDS</name>
              <description>DCACHE1 SRAM power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA2DRAMPDS</name>
              <description>DMA2D SRAM power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRAMPDS</name>
              <description>FDCAN and USB peripherals SRAM power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PKARAMPDS</name>
              <description>PKA32 SRAM power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM4FWU</name>
              <description>SRAM4 fast wakeup from Stop modes (Stop 0, 1, 2)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLASHFWU</name>
              <description>Flash memory fast wakeup from Stop modes (Stop 0, 1)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM3PDS1</name>
              <description>SRAM3 page 1 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM3PDS2</name>
              <description>SRAM3 page 2 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM3PDS3</name>
              <description>SRAM3 page 3 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM3PDS4</name>
              <description>SRAM3 page 4 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM3PDS5</name>
              <description>SRAM3 page 5 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM3PDS6</name>
              <description>SRAM3 page 6 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM3PDS7</name>
              <description>SRAM3 page 7 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM3PDS8</name>
              <description>SRAM3 page 8 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPRAMPDS</name>
              <description>Graphic peripherals (LTDC, GFXMMU) SRAM power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>JPEGRAMPDS</name>
              <description>JPEG SRAM power-down in Stop modes (Stop 0, 1)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRDRUN</name>
              <description>SmartRun domain in Run mode</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RUN_MODE</name>
                  <description>SmartRun domain AHB3 and APB3 clocks kept enabled in Stop mode (Stop 0, 1, 2)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP_MODE</name>
                  <description>SmartRun domain AHB3 and APB3 clocks disabled by default in Stop mode (Stop 0, 1, 2)</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CR3</name>
          <description>Power control register 3</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>REGSEL</name>
              <description>Regulator selection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LDO_SUPPLY</name>
                  <description>LDO regulator supply</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SMPS_SUPPLY</name>
                  <description>SMPS regulator supply</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FSTEN</name>
              <description>Fast soft start</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>VOSR</name>
          <description>Power voltage scaling register</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>USBBOOSTRDY</name>
              <description>USB EPOD booster ready</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BOOSTRDY</name>
              <description>EPOD booster ready</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VOSRDY</name>
              <description>Ready bit for VCORE voltage scaling output selection</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VOS</name>
              <description>VOS[1:0] Voltage scaling range selection field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SCALE1</name>
                  <description>Voltage scaling range 1</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCALE2</name>
                  <description>Voltage scaling range 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCALE3</name>
                  <description>Voltage scaling range 3</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCALE4</name>
                  <description>Voltage scaling range 4</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BOOSTEN</name>
              <description>EPOD booster enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USBPWREN</name>
              <description>USB Power enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USBBOOSTEN</name>
              <description>USB EPOD booster enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VDD11USBDIS</name>
              <description>OTG_HS VDD11USB disable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SVMCR</name>
          <description>Power supply voltage monitoring control register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PVDE</name>
              <description>Programmable voltage detector enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PVDLS</name>
              <description>PVDLS[2:0] Programmable voltage detector level selection field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PVDLEVEL_0</name>
                  <description>Voltage threshold detected by PVD 2.0 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PVDLEVEL_1</name>
                  <description>Voltage threshold detected by PVD 2.2 V</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PVDLEVEL_2</name>
                  <description>Voltage threshold detected by PVD 2.4 V</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PVDLEVEL_3</name>
                  <description>Voltage threshold detected by PVD 2.5 V</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PVDLEVEL_4</name>
                  <description>Voltage threshold detected by PVD 2.6 V</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PVDLEVEL_5</name>
                  <description>Voltage threshold detected by PVD 2.8 V</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PVDLEVEL_6</name>
                  <description>Voltage threshold detected by PVD 2.9 V</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PVDLEVEL_7</name>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UVMEN</name>
              <description>VDDUSB Independent USB supply voltage monitor enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IO2VMEN</name>
              <description>VDDIO2 Independent I/Os voltage monitor enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AVM1EN</name>
              <description>VDDA Independent analog supply voltage monitor 1 enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AVM2EN</name>
              <description>VDDA Independent analog supply voltage monitor 2 enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USV</name>
              <description>VDDUSB Independent USB supply valid</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IO2SV</name>
              <description>VDDIO2 Independent I/Os supply valid</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ASV</name>
              <description>VDDA Independent analog supply valid</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WUCR1</name>
          <description>Power wakeup control register 1</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WUPEN1</name>
              <description>Wakeup pin WKUP1 enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WUPEN2</name>
              <description>Wakeup pin WKUP2 enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WUPEN3</name>
              <description>Wakeup pin WKUP3 enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WUPEN4</name>
              <description>Wakeup pin WKUP4 enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WUPEN5</name>
              <description>Wakeup pin WKUP5 enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WUPEN6</name>
              <description>Wakeup pin WKUP6 enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WUPEN7</name>
              <description>Wakeup pin WKUP7 enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WUPEN8</name>
              <description>Wakeup pin WKUP8 enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
