modm-ext/data.modm.io/docs/svd/header_stm32u5g7xx.svd
        <register>
          <name>PDCRJ</name>
          <description>Power Port J pull-down control register</description>
          <addressOffset>0x9c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PD0</name>
              <description>Apply pull-down for PJ0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PD1</name>
              <description>Apply pull-down for PJ1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PD2</name>
              <description>Apply pull-down for PJ2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PD3</name>
              <description>Apply pull-down for PJ3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PD4</name>
              <description>Apply pull-down for PJ4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PD5</name>
              <description>Apply pull-down for PJ5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PD6</name>
              <description>Apply pull-down for PJ6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PD7</name>
              <description>Apply pull-down for PJ7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PD8</name>
              <description>Apply pull-down for PJ8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PD9</name>
              <description>Apply pull-down for PJ9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PD10</name>
              <description>Apply pull-down for PJ10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PD11</name>
              <description>Apply pull-down for PJ11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CR4</name>
          <description>Power power control register 4</description>
          <addressOffset>0xa8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SRAM1PDS4</name>
              <description>SRAM1 page 4 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM1PDS5</name>
              <description>SRAM1 page 5 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM1PDS6</name>
              <description>SRAM1 page 6 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM1PDS7</name>
              <description>SRAM1 page 7 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM1PDS8</name>
              <description>SRAM1 page 8 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM1PDS9</name>
              <description>SRAM1 page 9 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM1PDS10</name>
              <description>SRAM1 page 10 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM1PDS11</name>
              <description>SRAM1 page 11 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM1PDS12</name>
              <description>SRAM1 page 12 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM3PDS9</name>
              <description>SRAM3 page 9 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM3PDS10</name>
              <description>SRAM3 page 10 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM3PDS11</name>
              <description>SRAM3 page 11 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM3PDS12</name>
              <description>SRAM3 page 12 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM3PDS13</name>
              <description>SRAM3 page 13 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM5PDS1</name>
              <description>SRAM5 page 1 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM5PDS2</name>
              <description>SRAM5 page 2 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM5PDS3</name>
              <description>SRAM5 page 3 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM5PDS4</name>
              <description>SRAM5 page 4 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM5PDS5</name>
              <description>SRAM5 page 5 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM5PDS6</name>
              <description>SRAM5 page 6 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM5PDS7</name>
              <description>SRAM5 page 7 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM5PDS8</name>
              <description>SRAM5 page 8 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM5PDS9</name>
              <description>SRAM5 page 9 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM5PDS10</name>
              <description>SRAM5 page 10 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM5PDS11</name>
              <description>SRAM5 page 11 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM5PDS12</name>
              <description>SRAM5 page 12 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM5PDS13</name>
              <description>SRAM5 page 13 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CR5</name>
          <description>Power power control register 5</description>
          <addressOffset>0xac</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SRAM6PDS1</name>
              <description>SRAM6 page 1 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM6PDS2</name>
              <description>SRAM6 page 2 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM6PDS3</name>
              <description>SRAM6 page 3 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM6PDS4</name>
              <description>SRAM6 page 4 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM6PDS5</name>
              <description>SRAM6 page 5 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM6PDS6</name>
              <description>SRAM6 page 6 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM6PDS7</name>
              <description>SRAM6 page 7 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM6PDS8</name>
              <description>SRAM6 page 8 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
