modm-ext/data.modm.io/docs/svd/header_stm32u5g7xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RCC</name>
      <description>Reset and Clock Control</description>
      <groupName>RCC</groupName>
      <baseAddress>0x46020c00</baseAddress>
      <interrupt>
        <name>RCC</name>
        <description>RCC non secure global interrupt</description>
        <value>9</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <description>RCC clock control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MSISON</name>
              <description>Internal Multi Speed Oscillator (MSIS) Clock Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSIKERON</name>
              <description>MSI Enable for Some IPs Kernels</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSISRDY</name>
              <description>Internal Multi Speed Oscillator (MSIS) Clock Ready Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSIPLLEN</name>
              <description>Internal Multi Speed Oscillator (MSI) PLL Mode Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSIKON</name>
              <description>Internal Multi Speed Oscillator Kernel (MSIK) Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSIKRDY</name>
              <description>Internal Multi Speed Oscillator Kernel (MSIK) Ready Flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSIPLLSEL</name>
              <description>Internal Multi Speed Oscillator (MSI) PLL Mode Selection</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MSIS</name>
                  <description>MSIS selection for Pll Mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSIK</name>
                  <description>MSIK selection for Pll Mode</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSIPLLFAST</name>
              <description>Internal Multi Speed Oscillator (MSI) PLL Fast Mode Selection</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSION</name>
              <description>Internal High Speed Oscillator (HSI16) Clock Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSIKERON</name>
              <description>Internal High Speed Oscillator (HSI16) Clock Enable for some IPs Kernel</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSIRDY</name>
              <description>Internal High Speed Oscillator (HSI16) Clock Ready Flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSI48ON</name>
              <description>Internal High Speed Oscillator (HSI48) Clock Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSI48RDY</name>
              <description>Internal High Speed Oscillator (HSI48) Clock Ready Flag</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SHSION</name>
              <description>Internal High Speed Secure (SHSI) Clock Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SHSIRDY</name>
              <description>Internal High Speed Secure (SHSI) Clock Ready Flag</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSEON</name>
              <description>External High Speed Oscillator (HSE) Clock Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSERDY</name>
              <description>External High Speed Oscillator (HSE) Clock Ready</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSEBYP</name>
              <description>External High Speed Oscillator (HSE) Clock Bypass</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSSON</name>
              <description>HSE Clock Security System Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSEEXT</name>
              <description>External High Speed clock type in Bypass Mode</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ANALOG_MODE</name>
                  <description>HSE clock used as ANALOG clock source</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIGITAL_MODE</name>
                  <description>HSE clock used as DIGITAL clock source</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLL1ON</name>
              <description>System PLL 1 Clock Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL1RDY</name>
              <description>System PLL 1 Clock Ready Flag</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL2ON</name>
              <description>System PLL 2 Enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL2RDY</name>
              <description>System PLL 2 Ready Flag</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL3ON</name>
              <description>System PLL 3 Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL3RDY</name>
              <description>System PLL 3 Ready Flag</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ICSCR1</name>
          <description>RCC internal clock sources calibration register 1</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MSICAL3</name>
              <description>MSICAL[4:0] bits: MSIRC3 Clock Calibration for MSI Ranges 12 to 15</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>MSICAL2</name>
              <description>MSICAL[4:0] bits: MSIRC2 Clock Calibration for MSI Ranges 8 to 11</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>MSICAL1</name>
              <description>MSICAL[4:0] bits: MSIRC1 Clock Calibration for MSI Ranges 4 to 7</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>MSICAL0</name>
              <description>MSICAL[4:0] bits: MSIRC0 Clock Calibration for MSI Ranges 0 to 3</description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>MSIBIAS</name>
              <description>Internal Multi Speed oscillator (MSI) BIAS mode selection</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CONTINUOUS</name>
                  <description>Continuous mode selection for MSI</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLING</name>
                  <description>Sampling mode selection for MSI</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSIRGSEL</name>
              <description>Internal Multi Speed oscillator (MSI) range selection</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSIKRANGE</name>
              <description>Internal Multi Speed oscillator Kernel (MSIK) clock Ranges</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MSIKRANGE_0</name>
                  <description>MSIK = 48 MHz</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSIKRANGE_1</name>
                  <description>MSIK = 24 MHz</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSIKRANGE_2</name>
                  <description>MSIK = 16 MHz</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSIKRANGE_3</name>
                  <description>MSIK = 12 MHz</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSIKRANGE_4</name>
                  <description>MSIK = 4 MHz</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSIKRANGE_5</name>
                  <description>MSIK = 2 MHz</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSIKRANGE_6</name>
                  <description>MSIK = 1.5 MHz</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSIKRANGE_7</name>
                  <description>MSIK = 1 MHz</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSIKRANGE_8</name>
                  <description>MSIK = 3.072 MHz</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSIKRANGE_9</name>
                  <description>MSIK = 1.536 MHz</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSIKRANGE_10</name>
                  <description>MSIK = 1.024 MHz</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSIKRANGE_11</name>
                  <description>MSIK = 768 KHz</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSIKRANGE_12</name>
                  <description>MSIK = 400 KHz</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSIKRANGE_13</name>
                  <description>MSIK = 200 KHz</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSIKRANGE_14</name>
                  <description>MSIK = 150 KHz</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSIKRANGE_15</name>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSISRANGE</name>
              <description>Internal Multi Speed oscillator (MSI) clock Ranges</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MSISRANGE_0</name>
                  <description>MSIS = 48 MHz</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSISRANGE_1</name>
                  <description>MSIS = 24 MHz</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSISRANGE_2</name>
                  <description>MSIS = 16 MHz</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSISRANGE_3</name>
                  <description>MSIS = 12 MHz</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSISRANGE_4</name>
                  <description>MSIS = 4 MHz</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSISRANGE_5</name>
                  <description>MSIS = 2 MHz</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSISRANGE_6</name>
                  <description>MSIS = 1.5 MHz</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSISRANGE_7</name>
                  <description>MSIS = 1 MHz</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSISRANGE_8</name>
                  <description>MSIS = 3.072 MHz</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSISRANGE_9</name>
                  <description>MSIS = 1.536 MHz</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSISRANGE_10</name>
                  <description>MSIS = 1.024 MHz</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSISRANGE_11</name>
                  <description>MSIS = 768 KHz</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSISRANGE_12</name>
                  <description>MSIS = 400 KHz</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSISRANGE_13</name>
                  <description>MSIS = 200 KHz</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSISRANGE_14</name>
                  <description>MSIS = 150 KHz</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSISRANGE_15</name>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ICSCR2</name>
          <description>RCC internal clock sources calibration register 2</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MSITRIM3</name>
              <description>MSITRIM[4:0] bits: MSI Clock Trimming for Ranges 12 to 15</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>MSITRIM2</name>
              <description>MSITRIM[4:0] bits: MSI Clock Trimming for Ranges 8 to 11</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>MSITRIM1</name>
              <description>MSITRIM[4:0] bits: MSI Clock Trimming for Ranges 4 to 7</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>MSITRIM0</name>
              <description>MSITRIM[4:0] bits: MSI Clock Trimming for Ranges 0 to 3</description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ICSCR3</name>
          <description>RCC internal clock sources calibration register 3</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>HSICAL</name>
              <description>HSICAL[11:0] bits: HSI Clock Calibration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>HSITRIM</name>
              <description>HSITRIM[4:0] bits: HSI Clock Trimming</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CRRCR</name>
          <description>RCC Clock Recovery RC Register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>HSI48CAL</name>
              <description>HSI48CAL[4:0] bits: HSI48 Clock Calibration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
